app/controllers/session_controller.rb

 def create    #ユーザ認証とセッションの保存
  #Userモデルからユーザ名、パスワードが一致するユーザを検索
  @user = User.find_by(name: params[:name], password: params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? AND "users"."password" = ? LIMIT ?  [["name", "admin"], ["password", "1234"], ["LIMIT", 1]]