app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "admin"], ["password", "1234"], ["created_at", "2019-08-01 09:47:29.062899"], ["updated_at", "2019-08-01 09:47:29.062899"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save